In [2]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)

In [3]:
df_income = pd.read_csv('MedianHouseholdIncome2015.csv', engine='python')
df_income

      Geographic Area                    City Median Income
0                  AL              Abanda CDP         11207
1                  AL          Abbeville city         25615
2                  AL         Adamsville city         42575
3                  AL            Addison town         37083
4                  AL              Akron town         21667
...               ...                     ...           ...
29317              WY  Woods Landing-Jelm CDP           NaN
29318              WY            Worland city         41523
29319              WY             Wright town         77114
29320              WY              Yoder town         37500
29321              WY           Y-O Ranch CDP           NaN

[29322 rows x 3 columns]

In [4]:
df_income['Median Income'] =  pd.to_numeric(df_income['Median Income'].astype(str).str.replace(',',''), errors='coerce')

In [5]:
pd.to_numeric(df_income['Median Income'])

0        11207.0
1        25615.0
2        42575.0
3        37083.0
4        21667.0
          ...
29317        NaN
29318    41523.0
29319    77114.0
29320    37500.0
29321        NaN
Name: Median Income, Length: 29322, dtype: float64

In [6]:
df_income.head(5)

  Geographic Area             City  Median Income
0              AL       Abanda CDP        11207.0
1              AL   Abbeville city        25615.0
2              AL  Adamsville city        42575.0
3              AL     Addison town        37083.0
4              AL       Akron town        21667.0

In [7]:
df_income.isna().sum()

Geographic Area       0
City                  0
Median Income      1937
dtype: int64

In [10]:
df_income[df_income.isna().any(axis=1)]

      Geographic Area                    City  Median Income
44                 AL             Benton town            NaN
56                 AL          Bon Secour CDP            NaN
57                 AL              Boykin CDP            NaN
65                 AL        Bristow Cove CDP            NaN
71                 AL               Bucks CDP            NaN
...               ...                     ...            ...
29312              WY              Washam CDP            NaN
29313              WY     Westview Circle CDP            NaN
29315              WY             Whiting CDP            NaN
29317              WY  Woods Landing-Jelm CDP            NaN
29321              WY           Y-O Ranch CDP            NaN

[1937 rows x 3 columns]

In [11]:
df_income.dtypes

Geographic Area     object
City                object
Median Income      float64
dtype: object

In [12]:
df_income.groupby('Geographic Area')['Median Income'].mean()

Geographic Area
AK    52099.594406
AL    40577.309524
AR    35593.408915
AZ    42495.666667
CA    62097.352113
CO    58857.697044
CT    75149.652482
DC    70848.000000
DE    61792.407895
FL    49811.306215
GA    39781.803954
HI    64708.744966
IA    48116.048604
ID    42484.789720
IL    54052.706144
IN    47713.010786
KS    44838.943574
KY    45683.308151
LA    41635.905702
MA    71765.912863
MD    78126.496746
ME    45397.472868
MI    44685.505848
MN    51678.658343
MO    41747.616016
MS    35002.099125
MT    45119.981191
NC    43302.337589
ND    52141.705882
NE    46582.907407
NH    54026.318681
NJ    80584.406367
NM    40952.905363
NV    57322.970588
NY    69890.671514
OH    50457.210931
OK    40447.293003
OR    48088.066474
PA    51758.766157
RI    64537.542857
SC    39787.092838
SD    45408.261128
TN    42249.774882
TX    51335.326411
UT    60216.368771
VA    61867.679348
VT    46284.777778
WA    59315.282230
WI    50411.400778
WV    39097.117318
WY    60874.993464
Name: Median Income, dtype: float64

In [14]:
df_income["Median Income"] = df_income.groupby("Geographic Area").transform(lambda x: x.fillna(x.mean()))['Median Income']

In [15]:
df_income.isna().sum()

Geographic Area    0
City               0
Median Income      0
dtype: int64

In [16]:
df_income.to_csv('MedianHouseholdIncome2015_clean.csv')

In [17]:
df_poverty = pd.read_csv('PercentagePeopleBelowPovertyLevel.csv', engine='python')
df_poverty

      Geographic Area                    City poverty_rate
0                  AL              Abanda CDP         78.8
1                  AL          Abbeville city         29.1
2                  AL         Adamsville city         25.5
3                  AL            Addison town         30.7
4                  AL              Akron town           42
...               ...                     ...          ...
29324              WY  Woods Landing-Jelm CDP         18.6
29325              WY            Worland city         15.3
29326              WY             Wright town          5.9
29327              WY              Yoder town          5.4
29328              WY           Y-O Ranch CDP            0

[29329 rows x 3 columns]

In [18]:
df_poverty.dtypes

Geographic Area    object
City               object
poverty_rate       object
dtype: object

In [19]:
df_poverty.isna().sum()

Geographic Area    0
City               0
poverty_rate       0
dtype: int64

In [20]:
df_poverty['poverty_rate'] =  pd.to_numeric(df_poverty['poverty_rate'].astype(str).str.replace(',',''), errors='coerce')

In [21]:
df_poverty.dtypes

Geographic Area     object
City                object
poverty_rate       float64
dtype: object

In [22]:
df_poverty.shape

(29329, 3)

In [23]:
df_income.shape

(29322, 3)

In [24]:
df_poverty.to_csv('PercentagePeopleBelowPovertyLevel_clean.csv')

In [25]:
df_educ = pd.read_csv('PercentOver25CompletedHighSchool.csv', engine='python')

In [26]:
df_educ.dtypes

Geographic Area         object
City                    object
percent_completed_hs    object
dtype: object

In [27]:
df_educ.isna().sum()

Geographic Area         0
City                    0
percent_completed_hs    0
dtype: int64

In [28]:
df_educ.head()

  Geographic Area             City percent_completed_hs
0              AL       Abanda CDP                 21.2
1              AL   Abbeville city                 69.1
2              AL  Adamsville city                 78.9
3              AL     Addison town                 81.4
4              AL       Akron town                 68.6

In [29]:
df_educ.shape

(29329, 3)

In [30]:
df_educ['percent_completed_hs'] =  pd.to_numeric(df_educ['percent_completed_hs'].astype(str).str.replace(',',''), errors='coerce')

In [31]:
df_educ.dtypes

Geographic Area          object
City                     object
percent_completed_hs    float64
dtype: object

In [32]:
df_educ.to_csv('PercentOver25CompletedHighSchool_clean.csv')

In [33]:
df_kill = pd.read_csv('PoliceKillingsUS.csv', engine='python')

In [34]:
df_kill.dtypes

id                           int64
name                        object
date                        object
manner_of_death             object
armed                       object
age                        float64
gender                      object
race                        object
city                        object
state                       object
signs_of_mental_illness       bool
threat_level                object
flee                        object
body_camera                   bool
dtype: object

In [35]:
df_kill.head()

,id,name,date,manner_of_death,armed,age,gender,race,city,state,signs_of_mental_illness,threat_level,flee,body_camera
0,3,Tim Elliot,02/01/15,shot,gun,53.0,M,A,Shelton,WA,True,attack,Not fleeing,False
1,4,Lewis Lee Lembke,02/01/15,shot,gun,47.0,M,W,Aloha,OR,False,attack,Not fleeing,False
2,5,John Paul Quintero,03/01/15,shot and Tasered,unarmed,23.0,M,H,Wichita,KS,False,other,Not fleeing,False
3,8,Matthew Hoffman,04/01/15,shot,toy weapon,32.0,M,W,San Francisco,CA,True,attack,Not fleeing,False
4,9,Michael Rodriguez,04/01/15,shot,nail gun,39.0,M,H,Evans,CO,False,attack,Not fleeing,False

In [38]:
df_kill.date = pd.to_datetime(df_kill.date)

In [39]:
df_kill.dtypes

id                                  int64
name                               object
date                       datetime64[ns]
manner_of_death                    object
armed                              object
age                               float64
gender                             object
race                               object
city                               object
state                              object
signs_of_mental_illness              bool
threat_level                       object
flee                               object
body_camera                          bool
dtype: object

In [50]:
df_kill.shape

(2535, 15)

In [48]:
unarmed_items = ['unarmed ', 'vehicle', 'toy weapon', 'blunt object', 'hand torch', 'oar', 'stapler', 'bean-bag gun'\
                'fireworks ', 'air conditioner', 'motorcycle', 'carjack', 'flashlight', 'flagpole', 'pen']

In [49]:
df_kill['armed_cat'] = np.where(df_kill.armed.isin(unarmed_items), 0, 1)

In [51]:
df_kill.threat_level.value_counts()

attack          1611
other            766
undetermined     158
Name: threat_level, dtype: int64

In [52]:
df_kill['threat_cat'] = np.where(df_kill.threat_level== 'attack', 1, 0)

In [53]:
df_kill.flee.value_counts()

Not fleeing    1695
Car             385
Foot            294
Other            96
Name: flee, dtype: int64

In [54]:
df_kill['flee_cat'] = np.where(df_kill.flee== 'Not fleeing', 0, 1)

In [55]:
df_kill.dtypes

id                                  int64
name                               object
date                       datetime64[ns]
manner_of_death                    object
armed                              object
age                               float64
gender                             object
race                               object
city                               object
state                              object
signs_of_mental_illness              bool
threat_level                       object
flee                               object
body_camera                          bool
armed_cat                           int32
threat_cat                          int32
flee_cat                            int32
dtype: object

In [58]:
df_kill[['signs_of_mental_illness', 'body_camera']] = df_kill[['signs_of_mental_illness', 'body_camera']].astype(int)

In [59]:
df_kill.dtypes

id                                  int64
name                               object
date                       datetime64[ns]
manner_of_death                    object
armed                              object
age                               float64
gender                             object
race                               object
city                               object
state                              object
signs_of_mental_illness             int32
threat_level                       object
flee                               object
body_camera                         int32
armed_cat                           int32
threat_cat                          int32
flee_cat                            int32
dtype: object

In [60]:
df_kill_clean = df_kill.drop(['armed', 'threat_level', 'flee'], axis=1)

In [61]:
df_kill_clean.to_csv('PoliceKillingsUS_clean.csv')

In [62]:
df_race = pd.read_csv('ShareRaceByCity.csv', engine='python')

In [63]:
df_race.dtypes

Geographic area          object
City                     object
share_white              object
share_black              object
share_native_american    object
share_asian              object
share_hispanic           object
dtype: object

In [64]:
df_race.isna().sum()

Geographic area          0
City                     0
share_white              0
share_black              0
share_native_american    0
share_asian              0
share_hispanic           0
dtype: int64

In [67]:
df_race.columns.to_list()

['Geographic area',
 'City',
 'share_white',
 'share_black',
 'share_native_american',
 'share_asian',
 'share_hispanic']

In [70]:
numeric = [ 'share_white', 'share_black', 'share_native_american', 'share_asian', 'share_hispanic']

df_race[numeric] =  df_race[numeric].apply(pd.to_numeric, errors = 'coerce')

In [71]:
df_race.dtypes

Geographic area           object
City                      object
share_white              float64
share_black              float64
share_native_american    float64
share_asian              float64
share_hispanic           float64
dtype: object

In [72]:
df_race.shape

(29268, 7)

In [73]:
df_race.head()

,Geographic area,City,share_white,share_black,share_native_american,share_asian,share_hispanic
0,AL,Abanda CDP,67.2,30.2,0.0,0.0,1.6
1,AL,Abbeville city,54.4,41.4,0.1,1.0,3.1
2,AL,Adamsville city,52.3,44.9,0.5,0.3,2.3
3,AL,Addison town,99.1,0.1,0.0,0.1,0.4
4,AL,Akron town,13.2,86.5,0.0,0.0,0.3

In [74]:
df_race.to_csv('ShareRaceByCity_clean.csv')